In [1]:
import pandas as pd

1. create any list from you 2D List-to-Dataframe Conversion Given a 2D List, convert it into corresponding dataframe and display it.

In [3]:
lst = [
    ["Kamal", "ITI-AI", 3.4],
    ["Ashraf", "ITI-AI", 3.3],
    ["Alaa", "ITI-AI", 3.2]
]

cols = ["Student Name", "Course ID", "GPA"]

df = pd.DataFrame(lst, columns=cols)
df

  Student Name Course ID  GPA
0        Kamal    ITI-AI  3.4
1       Ashraf    ITI-AI  3.3
2         Alaa    ITI-AI  3.2

2. create any dic from you then Dictionary-to-Dataframe ConversionGiven a dictionary, convert it into corresponding dataframe and display it

In [4]:
dict = {
    "Student Name": ["Kamal", "Ashraf", "Alaa", "Sawsan"],
    "Course ID": ["ITI-AI", "ITI-AI", "ITI-AI", "ITI-AI"],
    "GPA": [3.4, 3.3, 3.2, 3.1]
}

df = pd.DataFrame(dict)
df

  Student Name Course ID  GPA
0        Kamal    ITI-AI  3.4
1       Ashraf    ITI-AI  3.3
2         Alaa    ITI-AI  3.2
3       Sawsan    ITI-AI  3.1

3. Selecting all the rows from the given dataframe in which ‘Percentage’ is greater than 80 using basic method.
```python
record = {
  
 'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
 'Age': [21, 19, 20, 18, 17, 21],
 'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
 'Percentage': [88, 92, 95, 70, 65, 78] }

columns = ['Name', 'Age', 'Stream', 'Percentage']
```

In [5]:
record = {
  
 'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
 'Age': [21, 19, 20, 18, 17, 21],
 'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
 'Percentage': [88, 92, 95, 70, 65, 78] }

columns = ['Name', 'Age', 'Stream', 'Percentage']

In [6]:
df = pd.DataFrame(record)
df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [7]:
df[df["Percentage"] > 80]

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95